/* Напишите программу на C++, которая отобразит ваше имя и адрес (можете
указать фиктивные данные). */
#include <iostream>

using namespace std;

int main()
{
    cout << "Sherlock Holmes. Baker st. 221b" << endl;
    return 0;
}
